In [2]:
# SQL Alchemy
from sqlalchemy import create_engine

# PyMySQL 
import pymysql
pymysql.install_as_MySQLdb()

# Config variables
from config import remote_db_endpoint, remote_db_port
from config import remote_dccrime_dbname, remote_dccrime_dbuser, remote_dccrime_dbpwd
#from config import local_dccrime_dbname, local_dccrime_dbuser, local_dccrime_dbpwd

# Import Pandas
import pandas as pd

In [3]:
engine = create_engine(f"mysql://{remote_dccrime_dbuser}:{remote_dccrime_dbpwd}@{remote_db_endpoint}:{remote_db_port}/{remote_dccrime_dbname}")
conn = engine.connect()

crime_totals = pd.read_sql("SELECT * from crime_totals", conn)
print(len(crime_totals))
crime_totals.head()

445

    ADW  Homicide  Robbery  Sex Abuse       BG
0   3.0       0.0      2.0        1.0  0001001
1   3.0       0.0     10.0        2.0  0001002
2   7.0       0.0      8.0        2.0  0001003
3  31.0       0.0     36.0        7.0  0001004
4   1.0       0.0      5.0        4.0  0002011

In [4]:
socioecon_data = pd.read_sql("SELECT * from socioecon_data", conn)
print(len(socioecon_data))
socioecon_data.head()

450

  Block Group ID  Total Population  Pct Poverty  Pct Unemployed  Pct Vacant
0        0001001            1382.0     0.000000        0.000000   16.620879
1        0001002            1463.0     3.075871        5.433746   15.702479
2        0001003             972.0     1.440329        9.256449   16.603053
3        0001004            1188.0     8.922559        3.095975   18.136439
4        0002011            3733.0     1.473346        6.604938    0.000000